---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructuralBeamStartSupport
source: html/bf1dbc44-0f6e-69e0-4344-fadb6e404eda.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructuralBeamStartSupport Property

"Beam Start Pocket Seat"

## Syntax (C#)
```csharp
public static ForgeTypeId StructuralBeamStartSupport { get; }
```